"""
Найти сумму чисел заданого интервала
"""
# a = int(input("Ведите первое значение: "))
# b = int(input("Ведите второе значение: "))
#
# if a > b:
#     a, b=b, a
# sum = 0
#
# while a <= b:
#     sum += a
#     a += 1
#
# print("сумма ", sum, end=" ")

"""
Найти наибольший общий делитель двух чисел
"""
# a1 = int(input("Ведите первое значение: "))
# b1 = int(input("Ведите второе значение: "))
#
# while b1 != 0:
#     o = b1
#     b1 = a1 % b1
#     a1 = o
#     print("наибольший общий делитель: ", a1)

"""
Найти все делители числа
"""
# number = int(input("Введите число: "))
# i = 1
#
# while number > i:
#     if number % i == 0:
#         print(f"делитель числа: {number} =", i)
#         i += 1
#
"""
 Определить количество цифр в числе
"""
# a2 = int(input("Введите число: "))
# count = 0
#
# while a2 > 0:
#     a2 = a2 // 10
#     count += 1
#     print(f"количество =", count)
"""
Ввести 10 чисел, определить количество положительных, отрицательных чисел и нулей.
Подсчитать количество четнызх и нечетных чисел.
Вывести статистику
"""
